---
type: NumericRevisionSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# NumericRevisionSettings

`Autodesk.Revit.DB.NumericRevisionSettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | NumericRevisionSettings | — | `` |
| Constructor | NumericRevisionSettings | 2016 | `public NumericRevisionSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2016 | `public bool IsEqual ( NumericRevisionSettings other )` |
| Method | IsValid | 2016 | `public bool IsValid ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MinimumDigits | 2022 | `public int MinimumDigits { get ; set ; }` |
| Property | Prefix | 2016 | `public string Prefix { get ; set ; }` |
| Property | StartNumber | 2016 | `public int StartNumber { get ; set ; }` |
| Property | Suffix | 2016 | `public string Suffix { get ; set ; }` |